package main

// myfunc main() {
// 	var s = []int{1, 2, 3, 4, 5, 6, 7, 8, 9}
// 	fmt.Println("最初的数据是:", s)
// 	// s[0][1][2] -->[:4] 取前四个
// 	fmt.Println("切片s前4位数据:", s[:4])    //stdout: 切片s前4位数据: [1 2 3 4]
// 	fmt.Println("切片3-4位数据:", s[2:4])   //stdout: 切片3-4位数据: [3 4]
// 	fmt.Println("切片从第4位开始的数据:", s[4:]) //stdout: 切片从第4位开始的数据: [6 7 8 9]

// 	fmt.Println("切片从第2个开始的数据:", s[1:]) // stdout: 切片删除第一个元素后: [3 4 5 6 7 8 9]

// 	s = s[1:]                     // 删除第一个元素
// 	fmt.Println("切片删除第一个元素后:", s) // stdout: 切片删除第一个元素后: 切片删除第一个元素后: [2 3 4 5 6 7 8 9]

// 	s = s[:len(s)-1]            //删除最后一个元素
// 	fmt.Println("删除最后一个元素:", s) //stdout: 删除最后一个元素: [2 3 4 5 6 7 8]

// 	s = append(s[0:1], s[2:]...) // 删除值为3的元素
// 	fmt.Println("删除值为3的元素:", s)  //stdout: 删除值为3的元素: [2 4 5 6 7 8]

// }
